# Network

## 1. Network Device

### 1) LoadBalancer

- **ADC**:

- Application Layer에서 동작하는 Load Balancer
- 4계층에서 동작하는 L4 Switch와 달리 애플리케이션의 프로토콜의 헤더와 내용을 이해하고 동작하므로 다양한 부하 분산이나 정보 수정 그리고 정보 필터링이 가능
- ADC는 이런 상세한 동작을 위해 Proxy로 동작
- 일부 소프트웨어 ADC를 제외한 대부분의 ADC는 L4 스위치의 기능도 가지고 있음
- 대부분의 ADC는 4계층에서 애플리케이션 계층까지 로드밸런싱 기능을 제공하고 FailOver(장애 극복 가능), Redirection 기능도 함께 수행하며 이외에도 애플리케이션 프로토콜을 이해하고 최적화하는 다양한 기능을 제공
- 캐싱, 압축, 콘텐츠 변환 및 재작성, 인코딩 변환 등이 가능하고 애플리케이션 프로토콜 최적화 기능도 제공
- 플로그인 형태로 보안 강화 기능을 추가로 제공해 WAF(Web Applicaiton Firewall) 기능이나 HTML, XML 검증 과 변환을 수행할 수 있음

- L4 Switch & ADC

- L4 스위치는 4계층에서 동작하면 TCP, UDP 정보를 기반으로 부하를 분산함
- L4 스위치는 TCP 계층에서의 최적화 와 보안 기능도 같이 제공
- L4 스위치는 TCP 레벨의 간단한 DoS(Denial of Service - 서비스 거부 공격) 공격을 방어하거나 서버 부하를 줄이기 위해 TCP 세션 재사용과 같이 보안과 성능을 높여주는 기능도 함께 제공할 수 있음
- L4 스위치의 성능 향상: connection pool을 활용
- ADC는 부하가 많이 걸리는 작업을 별도 수행가능한데 그 중 하나가 이미지나 정적 콘텐츠 캐싱
- ADC는 웹 서버가 수행하는 콘텐츠 압축 기능을  직접 수행해서 웹 서버의 부하를 줄일 수 있는데 ADC 하드웨어 가속이나 소프트웨어 최적화를 통해 이런 부하가 걸리는 작업을 최적화하는 기능이 있음

- 시스템 확장 방법

- 서비스를 운영하다 보면 시스템 하나로 모든 서비스를 감당할 수 없을 만큼 성장하는 경우가 생기는데 데이터 양이 늘거나 CPU나 메모리 사용량이 늘어 서버 하나로 서비스가 불가능해지면 시스템을 확장

- 스케일 업
시스템을 가장 쉽게 확장하는 방법인데 용량을 키우는 방법으로 기존 시스템에 CPU, 메모리, 디스크 같은 내부 컴포넌트 용량을 키우거나 새로 더 큰 용향의 시스템을 구매해서 서비스를 옮기는 방법인데 스케일이 가능한 요소나 서비스가 있고 그렇지 않은 경우가 있음

파일 저장소인 디스크는 어느 정도까지는 쉽게 확장이 가능하지만 CPU 나 메모리는 확장하기는 쉽지 않음

처음부터 스케일 업을 고려해서 CPU 여러 개를 꽂을 수 있고 메모리 뱅크를 많이 가진 보드를 구매해야 하는데 이 경우 초기 투자 비용이 커짐

스케일 업은 확장을 미리 고려해 시스템을 구축하면 초기 비용이 커지고 서비스에 적합한 시스템을 구매하면 확장이 필요할 때 기존 시스템을 버리고 더 큰 시스템을 새로 구매해야 하므로 기존 시스템 비용이 낭비되는 문제가 있음

스케일 업은 필요한 용량만큼 시스템을 늘리는데 비용이 기하급수적으로 증가하는 문제가 있는제 저가형 CPU보다 성능이 2배 우수한 CPU는 10배 이상 비용이 많이 들 수 있음 - 일정 시점이 지나면 비용 대비 성능의 증가폭이 떨어짐

- 스케일 아웃
같은 용량의 시스템(용량이 달라도 됨)을 여러 대 배치

사용자 천 명의 요청을 처리하는 시스템이 한 대 구동된다면 5천 명을 위해서 5대의 시스템을 병렬로 구성해서 운영하는 방법

스케일 아웃을 위해 새로 시스템 설계를 하거나 분산을 위한 별도의 프로세스를 운영하거나 LoadBalancer 와 같이 부하를 분산해주는 별도의 외부 시스템이 필요 

### 2) Router 와 Switch 실습 환경 생성: GNS3 이용

- **설치**:

- GNS3를 설치: https://www.gns3.com/
시뮬레이터가 아닌 에뮬레이터(가상 환경에서 실제 작동)

- CISCO 이미지 다운로드: https://networkrare.com/free-download-cisco-ios-images-for-gns3-and-eve-ng/
스위치로 사용할 C3745  이미지 와 라우터로 사용할 맨 아래에 있는 C7200 123-24T5 이미지를 다운로드 받아서 압축 해제

- GNS3에 이미지를 등록
GNS3를 구동한 후 [Edit] - [Preferences] 메뉴에서(MAC에서는 GNS3) Dynamips-IOS routes에서 New를 눌러서 3745 이미지를 선택한 후 This is an EthernetSwitch router를 선택해주면 스위치로 사용할 수 있게 됩니다.
넘어가다가 Idle-PC finder 버튼이 나오면 눌러서 명령어 주소를 찾아주어야 합니다.

ROUTER를 추가하는  This is an EthernetSwitch router를 체크하지 않고 슬롯만 추가해주면 됩니다.
Network Adapter 부분에서 slot 1번에 PA-4T* 을 slot 2번에 PA-4E를 선택

### 3) Router

- 라우터 와 스위치를 배치하고 연결이나 콘솔 접속

- [File] - [New Blank Project]를 선택하고 프로젝트 이름을 입력

- 라우터 나 스위치를 적절히 드래그 해서 배치하고 마우스 오른쪽 버튼을 눌러서 Start를 선택해야 사용할 수 있습니다.

- 라우터의 모든 인터페이스는 기본적으로 닫혀있으므로 활성화시켜야 하고 스위치는 모든 포트가 기본적으로 열려 있습니다.

- 라우터의 명령 모드
User EXEC Mode: Router >
    enable 명령으로 전환
Privileged EXEC Mode: Router #
    configure terminal 명령으로 전환하고 반대로 전환할 때는 Ctrl + Z
Global Configuration Mode: Router(config) #
    interface 인터페이스이름
Interface 설정 모드: Router(config-if)#

- 라우터나 스위치는 명령어를 RAM에서 수행하기 때문에 저장이 안되는데 현재 작업 내용을 저장하고자 하면 copy running config startup-config 명령을 수행해야 합니다.

- 3개의 라우터를 배치를 하고 첫번째 와 두번째는 Ethernet2/0 으로 연결했고 두번째와 세번째는 Ethernet2/1로 연결

- 첫번째 라우터에서 Ethernet2/0 을 활성화시키고 IP를 할당
router # configure terminal

router(config) # interaface ethernet2/0

router(config-if) # ip address [IP주소] [서브넷마스크]

```bash
ip address 192.168.1.1 255.255.255.0
```

router(config-if) # no shutdown
라우터의 인터페이스를 기본적으로 shutdown 이라서 활성화 시켜 주어야 합니다.
링크가 up 되는 메시지가 출력됩니다.

인터페이스 설정 확인
router(config-if) # exit
router(config) # exit
router # show ip interface brief

- 두번째 라우터에서 Ethernet2/0 을 활성화시키고 IP를 할당
router # configure terminal

router(config) # interaface ethernet2/0

router(config-if) # ip address [IP주소] [서브넷마스크]
```bash
ip address 192.168.1.254 255.255.255.0
```

router(config-if) # no shutdown
라우터의 인터페이스를 기본적으로 shutdown 이라서 활성화 시켜 주어야 합니다.
링크가 up 되는 메시지가 출력됩니다.

인터페이스 설정 확인
router(config-if) # exit
router(config) # exit
router # show ip interface brief

- 두번째 라우터에서 Ethernet2/1 을 활성화시키고 IP를 할당
router # configure terminal

router(config) # interaface ethernet2/1

router(config-if) # ip address [IP주소] [서브넷마스크]
```bash
ip address 192.168.2.254 255.255.255.0
```

router(config-if) # no shutdown
라우터의 인터페이스를 기본적으로 shutdown 이라서 활성화 시켜 주어야 합니다.
링크가 up 되는 메시지가 출력됩니다.

인터페이스 설정 확인
router(config-if) # exit
router(config) # exit
router # show ip interface brief

- 세번째 라우터에서 Ethernet2/1 을 활성화시키고 IP를 할당
router # configure terminal

router(config) # interaface ethernet2/1

router(config-if) # ip address [IP주소] [서브넷마스크]
```bash
ip address 192.168.2.1 255.255.255.0
```

router(config-if) # no shutdown
라우터의 인터페이스를 기본적으로 shutdown 이라서 활성화 시켜 주어야 합니다.
링크가 up 되는 메시지가 출력됩니다.

인터페이스 설정 확인
router(config-if) # exit
router(config) # exit
router # show ip interface brief

- 설정 저장

router # copy running-config startup-config

### 3) Routing 방식

- 라우팅 테이블 확인하는 명령: show ip route

- Direct Connected

- 케이블에 직접 연결된 경우로 IP 설정이 되어있고 인터페이스가 활성화 되어 있으면 자동으로 감지를 합니다.
- show cdp neighbors 명령을 수행하면 직접 연결된 장비가 확인이 됩니다. 

- Static Routing

- 정적 경로 설정으로 직접 경로를 가는 방법을 지정

```text
Router(config)# ip route 목적지네트워크주소 서브넷마스크 나가는인터페이스나IP 
```

R1에서 192.168.2.0/24로 나갈 수 있도록 static routing을 수행
```bash
ip route 192.168.2.0 255.255.255.0 192.168.1.254
```

Router # configure terminal
```text
Router(config)# ip route 192.168.2.0 255.255.255.0 192.168.1.254
Router(config)# exit
```

Router # show ip route
Router # ping 192.168.2.254      --- 성공
Router # ping 192.168.2.1          --- 실패(ping은 가지만 되돌아 오지를 못함 R3에서는 R1을 갈 수 없음)

R3에서 192.168.1.0/24로 나갈 수 있도록 static routing을 수행
Router # configure terminal
```text
Router(config)# ip route 192.168.1.0 255.255.255.0 192.168.2.254
Router(config)# exit
```

Router # show ip route
Router # ping 192.168.1.254      --- 성공
Router # ping 192.168.1.1        --- 성공 

- 삭제 명령은 앞에 no를 붙이면 됩니다.
```text
Router(config)# no ip route 192.168.1.0 255.255.255.0 192.168.2.254
```

- Dynamic Routing

- 직접 라우팅을 설정하는 것이 아니고 자기 자신을 광고하는 방식
- OSPF 설정
Router(config) # router ospf 번호
Router(config-router) # network 자신의네트워크주소 와일드카드마스크 area 지역번호

- R1은 192.168.1.0/24를 소유

```text
R1(config)# router ospf 1
```

R1(config-router) # network 192.168.1.0 0.0.0.255 area 0

- R2는 192.168.1.0/24, 192.168.2.0/24를 소유
```text
R2(config)# router ospf 1
```

R2(config-router) # network 192.168.1.0 0.0.0.255 area 0
R2(config-router) # network 192.168.2.0 0.0.0.255 area 0

- R3는 192.168.2.0/24를 소유
```text
R3(config)# router ospf 1
```

R3(config-router) # network 192.168.2.0 0.0.0.255 area 0

- 아무 라우터에서나 show ip route 하면 O 가 붙은 네트워크가 보이기 시작합니다
```text
Router# show ip route
```

### 4) Switch

- Switch는 라우터 와 Host(Server Computer)를 연결합니다.

- R1의 Ethernet 2/1 과 Fastethernet 1/0 과 연결 
- PC를 하나 추가해서 PC의 Ethernet 과 Switch의 FastEthernet 1/1과 연결
- 부팅

- 새로 연결된 라우터(R1)의 Ethernet2/1 에 IP를 설정하고 OSPF로 광고

router # configure terminal

router(config) # interaface ethernet2/1

router(config-if) # ip address 192.168.0.1 255.255.255.0

router(config-if) # no shutdown

router(config-if) # exit

```text
R1(config)# router ospf 1
```

R1(config-router) # network 192.168.0.0 0.0.0.255 area 0

R1(config-router) # exit

R1(config) # exit

```text
R1# show ip interface brief

R1# show ip route
```

- Switch 설정

```text
switch# configure terminal
```

#vlan에 IP 할당
```text
switch(config)# interface vlan 1
switch(config-if)# ip address 192.168.0.2 255.255.255.0
switch(config-if)# no shutdown
```

#vlan에서 라우터로 ping
```text
switch(config-if)# exit
switch(config)# exit
switch# ping 192.168.0.1        #성공
switch# ping 192.168.2.1        #성공(자신에게 연결된 라우터를 통해서 외부로 접속)
```

#기본 게이트웨이 설정
```text
switch(config)# ip default-gateway 192.168.0.1
```

#설정 저장
```text
switch# copy running-config startup-config
```

- 포트 설정
```text
switch(config)# interface 포트
```

#속도 설정
```text
switch(config-if)# speed {10 | 100 | 1000 | auto}
```

#duplex(half duplex - 어느 한 순간에 송신이나 수신 하나만 가능, full duplex - 동시에 송수신 가능)
```text
switch(config-if)# duplex {auto | full | half}
```

#활성화 및 비활성화 - shutdown, no shutdown

#전체 확인: show interfaces

#포트 보안 - 특정 MAC-Address가 아니면 다운
```text
switch(config-if)# switchport mode access
switch(config-if)# switchport port-security maximum 개수            
switch(config-if)# switchport port-security mac-address 실제연결될mac-address
switch(config-if)# switchport port-security mac-address sticky
switch(config-if)# switchport port-security violation {protect | restrict | shutdown}
```

protect를 설정하면 정상적으로 전송하고 보안 위반 프레임만 폐기
restrict를 설정하면 정상적으로 전송하고 보안 위반 프레임이 발생하면 경고 메시지 출력
shutdown은 모든 데이터를 폐기

- **VLAN**:

- VLAN 생성

```text
SW(config)# vlan 번호     #최근 이미지

SW# vlan database
SW(vlan)# vlan 번호 name 이름
SW(vlan)# apply
```

#vlan 2번 생성
```text
ESW1(vlan)#vlan 2 name sales
ESW1(vlan)#apply
```

- VLAN에 포트(인터페이스 할당)
```text
SW(config-if)# switchport access vlan 번호
```

#fastethernet1/1 번을 vlan 1번에 할당
```text
ESW1#configure terminal
ESW1(config)#interface fastethernet1/1
ESW1(config-if)#switchport access vlan 1
```

#fastethernet1/2 번을 vlan 2번에 할당
```text
ESW1#configure terminal
ESW1(config)#interface fastethernet1/2
ESW1(config-if)#switchport access vlan 2
```

#할당 학인
```text
ESW1#show vlan-switch 
```

- Trunk Port(스위치 와 스위치가 연결된 port로 모든 VLAN이 통신 가능하도록 만드는 포트) 설정
```text
ESW1(config-if)#switchport mode trunk(일반 포트로 전환할 때는 access)
ESW1(config-if)#switchport trunk encapsulation dot1q
```

